app/views/comments/_form.html.erb

  <%= display_errors_for(comment) %>
  <%= form_with model: [comment.topic.group, comment.topic, comment] do |f|%>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]