app/views/topics/new.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<h1>Submitting Topic To <%= @topic.group.name %></h1>