app/views/topics/show.html.erb

</div>
<% @topic.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = ?  [["topic_id", 1]]