app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(comment_params)
    redirect_to group_topic_path(@comment.topic.group, @comment.topic)
---
INSERT INTO "comments" ("content", "user_id", "topic_id") VALUES (?, ?, ?)  [["content", "ping"], ["user_id", 6], ["topic_id", 2]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]