app/controllers/groups_controller.rb

  def show
    @group = Group.find(params[:id])
    @topics = @group.topics.page params[:page]
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "topics".* FROM "topics" WHERE "topics"."group_id" = ?  [["group_id", 1]]