app/controllers/sessions_controller.rb

  def create
    @name = params[:username]
    user = User.find_by(username: @name)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "test"], ["LIMIT", 1]]