app/controllers/topics_controller.rb

  def index
    #Topic sorting
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"

  def show
    #implement comment sorting
    @topic = Topic.find(params[:id])
    @group = @topic.group
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    Topic.create(topic_params)
---
INSERT INTO "topics" ("title", "content", "user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ping"], ["content", "pong\r\n"], ["user_id", 6], ["group_id", 1], ["created_at", "2020-02-09 06:07:21.839335"], ["updated_at", "2020-02-09 06:07:21.839335"]]